这是错误的测试程序
/*词法错误*/
char n = 'a ;    /*字符少了个分号*/
int m = 0x0 ;    /*错误的16进制*/
int i = 09 ;	 /*错误的八进制格式*/
int d = 1.0E-;   /*错误的常数格式*/

/*语法错误*/
int a *;	 /*多了个乘号*/
record stack     /*少了左大括号*/
 int e;
 char g;}
real f = 2.1;	 /*少了个分号*/

/*语义错误*/
call a(1,2);     /*对普通变量使用了函数调用符*/
real a;		 /*变量名的重复声明*/
c = 1;		 /*变量未声明就使用*/
int[3] b;
b[1.0] = 1; 	 /*数组操作符中不是整数*/
a[0] = 1+2;	 /*对普通变量使用了数组操作符*/
call addSum(1);  /*函数未声明便使用*/
proc int addSum（int x,int y){   /*使用了中文的括号*/
  char c;
  return c;	 /*返回类型和声明的函数返回类型不匹配*/
}
call addSum(1)	 /*函数参数与声明的参数个数不匹配*/
/**这是个错误的测试/
